PERSONALITYLIST = ['กำลังศึกษามหาวิทยาลัย', 'ติดตามทุกสถานการณ์', 'รักเพื่อน', 'เจ้าชายไอที', 'กีฬาเป็นยาวิเศษ', 'เข้าหาง่าย/เป็นมิตร', 'อยู่หอทั้งวัน', 'รวมกันมันส์กว่า!', 'มีโรงหนังเป็นบ้านหลังที่สอง', 'เดินห้างฆ่าเวลา', 'หมูกระทะ lover', 'มี cafe เป็นที่พักใจ', 'Event อย่าได้พลาด', 'ดาวไอจี/ดาวต๊อกต๊อก', 'introvert ฮ้าฟฟู่ววว', 'ทำอาหารกินเอง', 'สายไม่ทำ รอกินอย่างเดียว', 'สายกินข้าวดึก', 'กินคลีน รักสุขภาพ', 'เจ้าหญิงขนมหวาน', 'สายกินเหล้า', 'สายยังไงก็ได้ อิ่มเหมือนกัน', 'จิตรกรน้อย', 'ดนตรีนั้นคือชีวิต', 'ดูหนัง/ซีรี่ย์', 'ดูอนิเมะ', 'อ่าน Manga', 'เจ้าแม่แฟชั่น', 'เจ้าชายน้ำหอม', 'นิสิตตัวอย่าง', 'สายเก็บ A', 'ชาวหนี F', 'เข้าเดือนจริงจัง', 'ลูกรักอาจารย์', 'นอนหอกลาง', 'เช้าแค่ไหนก็จะไปเรียน', 'เข้าห้องสอบทราบแค่รหัสนิสิต', 'ให้เมทยืมของได้', 'อย่ามายุ่งกับของชั้นนะ', 'Early bird (ชอบการตื่นเช้า)', 'Night Owl (ชอบการนอนดึก)', 'รักความสะอาด', 'จัดของเป็นระเบียบ', 'ทำความสะอาดประจำ', 'ทำบ้างเป็นบางที', 'ไม่ค่อยได้ทำความสะอาด', 'จ้างแม่บ้านทำความสะอาด', 'เปิดแอร์ทั้งวัน', 'เปิดแอร์ตอนนอน', 'ไม่ค่อยเปิดแอร์', 'Grab บัตรทอง (สั่ง food delivery บ่อย)', 'ลูกค้า VIP Lazada (สั่งสินค้า Online บ่อย)', 'ปลูกต้นไม้', 'เลี้ยงสัตว์เลี้ยง', 'เลี้ยงสัตว์หายาก (Exotic)', 'ดูดวง', 'หนอนหนังสือ', 'Cosplay', 'ดูการแข่งกีฬา/E-sports', 'เล่นกีฬา', 'เล่นเกม', 'สะสม Models', 'ถ่ายภาพ', 'วาดภาพ', 'ฟังเพลง']


SOCIALBUTTERFLY = {'รักเพื่อน':1,'เข้าหาง่าย/เป็นมิตร':0.5,'รวมกันมันส์กว่า!':1,'มีโรงหนังเป็นบ้านหลังที่สอง':0.5, 'เดินห้างฆ่าเวลา':0.5, 'หมูกระทะ lover':0.5, 'มี cafe เป็นที่พักใจ':0.5, 'Event อย่าได้พลาด':1, 'ดาวไอจี/ดาวต๊อกต๊อก':1}

FOODIE = {'หมูกระทะ lover':1, 'มี cafe เป็นที่พักใจ':1, 'ทำอาหารกินเอง':3, 'สายไม่ทำ รอกินอย่างเดียว':1, 'กินคลีน รักสุขภาพ':0.5, 'เจ้าหญิงขนมหวาน':1, 'สายกินเหล้า':0.5}

ARTISTIC = {'จิตรกรน้อย':2, 'ดนตรีนั้นคือชีวิต':2, 'ดูหนัง/ซีรี่ย์':0.5, 'ดูอนิเมะ':0.5, 'อ่าน Manga':0.5, 'เจ้าแม่แฟชั่น':1, 'เจ้าชายน้ำหอม':1}

SCHOLAR={'นิสิตตัวอย่าง':2, 'สายเก็บ A':1, 'เข้าเดือนจริงจัง':1, 'ลูกรักอาจารย์':1, 'นอนหอกลาง':1, 'เช้าแค่ไหนก็จะไปเรียน':1}

NEATNESS={'รักความสะอาด':1, 'จัดของเป็นระเบียบ':1, 'ทำความสะอาดประจำ':3, 'ทำบ้างเป็นบางที':1, 'จ้างแม่บ้านทำความสะอาด':3}

COZYNESS ={'จ้างแม่บ้านทำความสะอาด':2, 'เปิดแอร์ทั้งวัน':2, 'เปิดแอร์ตอนนอน':1, 'Grab บัตรทอง (สั่ง food delivery บ่อย)':1, 'ลูกค้า VIP Lazada (สั่งสินค้า Online บ่อย)':1}

HOBBY ={'ปลูกต้นไม้':1, 'เลี้ยงสัตว์เลี้ยง':1, 'เลี้ยงสัตว์หายาก (Exotic)':1, 'ดูดวง':1, 'หนอนหนังสือ':1, 'Cosplay':1, 'ดูการแข่งกีฬา/E-sports':1, 'เล่นกีฬา':1, 'เล่นเกม':1, 'สะสม Models':1, 'ถ่ายภาพ':1, 'วาดภาพ':1, 'ฟังเพลง':1}

CATEGORYLIST = {'SOCIALBUTTERFLY':SOCIALBUTTERFLY,'FOODIE':FOODIE,'ARTISTIC':ARTISTIC,'SCHOLAR':SCHOLAR,'NEATNESS':NEATNESS,'COZYNESS':COZYNESS,'HOBBY':HOBBY}
